#pragma warning(disable:4996)
#include<stdio.h>
int main()
{
	int i, j = 0, sq;
	for (i = 2; i <= 1000; i++)
	{
		sq = i * i;
		if (sq >= 10 && sq < 100 && sq % 10 == i)//平方为两位数,i必定为两位数(不考虑2和3的情况下)
		{
			printf("%d\n", i);
			j++;
		}
		if (sq > 100 && sq <= 999 && sq % 100 == i)//平方为三位数,i必定为两位数,100和999开根号就能验证
		{
			printf("%d\n", i);
			j++;
		}
		if (sq > 1000 && sq <= 9999 && (sq % 1000) % 100 == i)//平方sq为四位数,i必定为两位数,1000和9999开根号就能验证
		{
			printf("%d\n", i);
			j++;
		}
		if (sq > 10000 && sq < 99999 && (sq % 10000) % 1000 == i)//平方sq为五位数,i必定为三位数,10000和99999开根号就能验证
		{
			printf("%d\n", i);
			j++;
		}
		if (sq > 100000 && sq <= 999999 && (((sq % 100000) % 10000) % 1000 == i))//平方为六位数,i必定为三位数,100000和999999开根号就能验证
		{
			printf("%d\n", i);
			j++;
		}
	}
	printf("同构数一共有%d个\n", j);
	return 0;
}