#pragma warning(disable:4996)
#include<stdio.h>
int main()
{
	int i, j = 0, sq;//sq为平方(square)
	for (i = 2; i <= 9; i++)//2和3平方都是一位数,明显不是,不单独分开弄个循环了,其余平方两位数
	{
		sq = i * i;
		if (sq % 10 == i)//取个位与一位数i比较
		{
			printf("%d\n", i);
			j++;
		}
	}
	for (i = 10; i <= 31; i++)//31的平方为961,10~31的平方为三位数
	{
		sq = i * i;
		if (sq % 100 == i)//取个位和十位与二位数i比较
		{
			printf("%d\n", i);
			j++;
		}
	}
	for (i = 31; i <= 99; i++)//99的平方为9801,31~99的平方都为四位数
	{
		sq = i * i;
		if ((sq % 1000) % 100 == i)//取个位和十位与二位数i比较
		{
			printf("%d\n", i);
			j++;
		}
	}
	for (i = 100; i <= 316; i++)//316的平方=99856,100~316的平方都为五位数
	{
		{
			sq = i * i;
			if ((sq % 10000) % 1000 == i)//取个位十位和百位与三位数i比较
				printf("%d\n", i);
			j++;
		}
	}
	for (i = 317; i <= 999; i++)//999的平方为998001,317~999的平方都为六位数
	{
		sq = i * i;
		if (((sq % 100000) % 10000) % 1000 == i)//取个位十位和百位与三位数i比较
		{
			printf("%d\n", i);
			j++;
		}
	}
	printf("同构数一共有%d个\n", j);//1000明显也不是同构数,不单独写出来了
	return 0;
}